{"label":"Battles","text":"On 30 November 2023, in Rio de Janeiro - Central Zone (Rio de Janeiro), police forces exchanged fire with drug traffickers in the Morro dos Prazeres community, during an operation to arrest fugitives from the state of Goias. Three suspects were shot and killed. One of them ran away. 3 fatalities."}
{"label":"Battles","text":"On 30 November 2023, government security forces (SNA) and Habar Gedir clan militia conducted a joint military operation against Al Shabaab position in Cinjir village near Budbud village (Ceel Dheere, Galgaduud). Both sides exchanged gunfire. At least three militants were killed."}
{"label":"Battles","text":"On 1 December 2023, a heavy exchange of fire erupted between Hamas militants and Israeli troops in Al Tuam area and northwest of Gaza City (coded to Gaza - Mukhayyam ash Shati) (Gaza City, Gaza Strip). Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, Russian and Ukrainian military clashed near Robotyne, Zaporizhia. Russian military forces shelled Robotyne. There were no casualties."}
{"label":"Battles","text":"On 30 November 2023, in Port-au-Prince - Tabarre, Ouest, there were armed clashes between members of the Vitelhomme Gang and members of the 400 Mawozo Gang in Torcelle. This clash is part of an ongoing fight between these two gangs after some Vitelhomme gang members joined the 400 Mawozo (coded separately). Casualties unknown."}
{"label":"Battles","text":"On 30 November 2023, in the rural area of Briceno municipality (Antioquia), Gulf Clan members and 36 Front FARC dissidents clashed in the Robal and El Hoyo veredas. The clashed caused the displacement of 200 farmers (coded separately). Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, in Salgado (Sergipe), civil police officers exchanged fire with an armed suspect during an operation. During the clash, the suspect was shot and killed. He had a criminal record for drug trafficking and homicide. 1 fatality."}
{"label":"Battles","text":"On 30 November 2023, Al Aqsa Martyrs Brigade militants exchanged fire with Israeli forces that raided the Kafr Saba neighborhood in Qalqilyah (Qalqilya, West Bank). There were no casualties."}
{"label":"Battles","text":"On 30 November 2023, in Fresnillo, Zacatecas, armed individuals ambushed the director of the municipal police around avenida Paseo del Mineral. The officers answered the attack and a clash ensued. Two police officers, including the director were killed. A passer by was also killed. Several police officers were injured. 3 fatalities."}
{"label":"Battles","text":"On 30 November 2023, overnight, Al Shabaab carried out an attack against ATMIS UPDF and SNA at a base in Qoryooley village (Marka, Lower Shabelle). The fighting started when RPGs and heavy weapons fired from both sides. There were no casualties. Al Shabaab claimed responsibility."}
{"label":"Battles","text":"Around 1 December 2023 (as reported), in Sao Jose dos Campos (Sao Paulo), members from rival drug trafficking groups exchanged fire. One suspect was shot and hospitalized. He ran away and was arrested in the state of Minas Gerais. A woman was also hit by a stray bullet during the clash and died. 1 fatality."}
{"label":"Battles","text":"On 1 December 2023, a heavy exchange of fire erupted between Hamas militants and Israeli troops in west of Gaza City and Gaza - Tal el Hawa (Gaza City, Gaza Strip). Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, near Sin In village (Hsipaw township, Kyaukme district, Shan-North state), the combined troops of the Ta'ang National Liberation Army and allies attacked and captured the Sin In Police Station around 6 am. Two police were captured as prisoners of war and combined troops seized 8 rifles, 3 pistols, ammunition and accessories. The TNLA and combined troops also destroyed the Sin In bridge. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, Ukrainian military forces advanced near Dibrova, Luhansk, clashing with the Russian military. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, in Kawkareik town (Kawkareik township, Kawkareik district, Kayin state), the combined troops of the Karen National Liberation Army and People's Defense Force (under NUG) attacked the Myanmar military stationed in the town at Yone Gyi Anauk, Tha Pyay Kone, Myo Taw Oo, No.1 Chaung Taung (Department of Land Record Office), and at the town entrance around 5 am. During the armed clash, the military conducted airstrikes with helicopters and fighter jets around 10 am and around 3 locals were injured. The military IB-97 and the artillery corp near the Hlaing Wa village also fired heavy weapons as reinforcement. Some government department office buildings including a fire service department and department of industrial farming office were also destroyed."}
{"label":"Battles","text":"On 30 November 2023, SAF air-raids and artillery shelling targeted RFS while RSF responded with anti-aircraft fire in Sports City area in and around Khartoum - Al Mujahdeen (Khartoum, Khartoum). Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, Russian military forces advanced east of Terny, Donetsk, clashing with the Ukrainian military. Casualties unknown."}
{"label":"Battles","text":"On 30 November 2023, a police officer was shot and injured during an arrest attempt in the Ur neighborhood of Baghdad - Adhamiya. There were no fatalities."}
{"label":"Battles","text":"On 30 November 2023, clashes took place between QSD and two drug dealers accused of dealing with regime forces in Kasra town in Deir ez Zor countryside, killing the two drug dealers. 2 fatalities."}
{"label":"Battles","text":"On 30 November 2023, the M23 supported by RDF clashed with FARDC at Katanda Bridge, along the Kitshanga-Muhanga axis, Bashali-Mokoto groupement, Rutshuru (Rutshuru, Nord-Kivu). No fatalities reported."}
{"label":"Battles","text":"On 30 November 2023, Israeli forces killed 2 PIJ militants in clashes during a raid on Jenin - Mukhayyam Jenin (Jenin, West Bank). Israeli military forces also killed 2 Palestinian children during the military operation."}
{"label":"Battles","text":"On 1 December 2023, in Cuitlahuac, Veracruz, there was an armed clash between the state police and National Guard against several armed men during a police patrol in El Polvoron. Three armed men were arrested. Two people were killed. 2 fatalities."}
{"label":"Battles","text":"On 30 November 2023, in Macapa (Amapa), a drug trafficking suspect exchanged fire with military police during a police patrol in the Perpetuo Socorro neighborhood. The drug trafficker was killed. 1 fatality."}
{"label":"Battles","text":"On 1 December 2023, regime forces exchanged mortar shelling with Al Fath Al Mubeen Operation Room and HTS on Kabani axis in Lattakia countryside, injuring a HTS member. There were no fatalities."}
{"label":"Battles","text":"On 30 November 2023, Israeli forces opened fire at an unidentified Palestinian assailant that ran over Israeli forces near Beqaot (Tubas, West Bank). The assailant was killed and 2 Israeli soldiers were wounded."}
{"label":"Battles","text":"On 1 December 2023, Russian military forces attacked the Ukrainian military near Torske, Donetsk. The Russian military shelled Torske. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, near Shwe Nyein Chan village (Shwegu township, Bhamo district, Kachin state), the combined troops of the Kachin Independence Army and People's Defense Force - Myohla attacked the Myanmar military outpost where around 30 soldiers stationed near a monastery around 4 am and captured the outpost around 8 am. The combined troops also seized some prisoners of war and weapons and ammunition. There were an unspecified number of fatalities. Unknown fatalities coded as 3."}
{"label":"Battles","text":"On 30 November 2023, in Iranduba municipality (Amazonas), unknown armed individuals shot and killed a member of the CV in the Sao Francisco do Laguinho region. The CV member was shot approximately 30 times, indicating an execution. The deceased had been receiving death threats from PCC members. 1 fatality."}
{"label":"Battles","text":"On 30 November 2023, in Rio de Janeiro - West Zone (Rio de Janeiro), the military police exchanged fire with two men allied with the Zinho militia in the Pingo D'Agua community, Guaratiba neighborhood. One suspect was killed and the other was injured. The clash happened as a result of an operation aimed at arresting those responsible for killing an off-duty military police officer who was investigating the police ties with the militia the week prior (coded separately). 1 fatality."}
{"label":"Battles","text":"On 1 December 2023, Tribal and Clan Forces attacked QSD positions on the outskirts of Eastern Jurdi town in Deir ez Zor countryside. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, Russian military forces attacked the Ukrainian military, but were repelled near Ivanivske, Donetsk. Casualties unknown."}
{"label":"Battles","text":"On 30 November 2023, in Campo Grande (Mato Grosso do Sul), an armed individual shot and killed a man in the Santa Luzia neighborhood. Police believe the deceased was killed in an ambush motivated by drug trafficking disputes, since police found cash and portions of drugs with the deceased. 1 fatality."}
{"label":"Battles","text":"On 30 November 2023, in Nova Iguacu (Rio de Janeiro), members from the TCP exchanged fire with the Tubarao militia in the Km 32 neighborhood. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, Russian military forces attacked Ukrainian forces near Avdiivka, Donetsk. The Russian military shelled Avdiivka. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, clashes took place between regime forces supported by YPG against JWS on Jalbul axis in Aleppo countryside. Casualties unknown."}
{"label":"Battles","text":"On 30 November 2023, opposition repels snipers shot and killed a regime soldier on Al Burayj axis in Idleb countryside. 1 fatality."}
{"label":"Battles","text":"On 1 December 2023, in Santiago de Queretaro, Queretaro, two municipal police officers were shot and injured by two armed individuals when they were attending a police call in Colonia Jardines de Azucenas."}
{"label":"Battles","text":"On 1 December 2023, in Rio de Janeiro - North Zone (Rio de Janeiro), unknown shooters exchanged fire in the Inhauma, Penha, Tomas Coelho, and Guadalupe neighborhoods. Casualties unknown."}
{"label":"Battles","text":"On 30 November 2023, ENDF and Fano clashed at Negida Mariam on the main road between Bahir Dar town Sebatamit Kebele and Tis Abay (location coded to Tis Abay, Bahirdar Zuria, West Gojam, Amhara). The ENDF was suspected to have attempted to free Tis Abay from Fano control. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, in Namhkan township (Muse district, Shan-North state), the Ta'ang National Liberation Army and allies attacked the Myanmar military Sa Khan Thit outpost. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, Russian military forces attacked the Ukrainian military, but were repelled near Hryhorivka, Donetsk. Casualties unknown."}
{"label":"Battles","text":"On 30 November 2023, in Mariani, Ouest, police forces clashed with gang members as they carried out an anti-gang operation between Gressier and Carrefour communes. During clashes, a police officer was killed and another one was injured. The corpse of the deceased was desecrated by the gangsters, who recorded the scene on video. 1 fatality, 1 injured."}
{"label":"Battles","text":"On 1 December 2023, the Kebbi militia shot and killed a member of an unidentified armed group in Tunga village (Bunza, Kebbi). The suspect was killed while shooting arrows indiscriminately at the people."}
{"label":"Battles","text":"On 1 December 2023, in Tijuana, Baja California, armed individuals in a vehicle shot at a municipal police officer in a drive-by in colonia Sanchez Taboada. However, the police officer was not injured."}
{"label":"Battles","text":"On 1 December 2023, in Kawt Nwe village (Kawkareik township, Kawkareik district, Kayin state), the combined troops of the Karen National Liberation Army and allies attacked the Myanmar military outpost around 5 am. The battle took around half an hour and the military soldiers deserted the outpost and retreated. Casualties unknown."}
{"label":"Battles","text":"On 1 December 2023, in Rio de Janeiro - North Zone (Rio de Janeiro), CV and TCP members exchanged fire in the Morro do Fuba community, Agua Santa neighborhood. Three TCP members were shot and two of them were killed. 2 fatalities."}
{"label":"Battles","text":"On 1 December 2023, SAF air-raids targeted RSF while RSF responded with anti-aircraft fire in Khartoum - Al Mamoura (Khartoum, Khartoum). Casualties unknown."}
{"label":"Battles","text":"On 30 November 2023, JNIM militants attacked the town of Diapaga (Diapaga, Tapoa). The attack was repelled volunteer fighters (VDP). Two civilians were killed including a woman and about ten were wounded."}
{"label":"Battles","text":"On 30 November 2023, clashes took place between Hamza Division and regime forces supported by YPG on Jalbul axis in Aleppo countryside, injuring three Hamza Division members. There were no fatalities."}
{"label":"Battles","text":"Around 1 December 2023 (as reported), SAF and RSF clashed southeast of Al Musawwarat Al Safra and Al Nagaa historical site 50km near Shendi (Shendi, River Nile). SAF claimed it repelled an attack from an RSF force entering the area from Bahri, and 'destroyed' an unspecified number of RSF. SAF also claimed it lost 3 fighters. Unspecified number of RSF fatalities coded as 3. Total fatalities coded as 6."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Hamas militants attacked Israeli troops stationed north of Deir El Balah (Deir al Balah, Gaza Strip) with 3 Zawari drones. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, regime forces shelled the vicinity of Maarbalit town in Idleb countryside with heavy artillery. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Hannivka, Donetsk. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Pivnichne, Donetsk. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Toretsk, Donetsk. A civilian was wounded."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, SAF shelled artillery targeting RSF in Khartoum - Al Taif (Khartoum, Khartoum). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Berestove, Kharkiv. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, a suspected US drone conducted an airstrike targeted a pro-Iranian militias' position in Al Kornish neighborhood in Al-Bukamal city in Deir ez Zor countryside. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Novoukrainka, Donetsk. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, regime forces shelled Deir Sunbul town in Idleb countryside with artillery. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, in Buthidaung town (Buthidaung township, Maungdaw district, Rakhine state), the Myanmar military stationed in Ah Lo Taw Pyae monastery at the town entrance fired heavy weapons and small arms around 12 pm for 30 minutes and hit the Myo Thit Basic Education Middle School at the town entrance. There were no casualties."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Poltavka, Zaporizhia. There were no casualties."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Ivanivka, Kharkiv. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, regime forces shelled Kafr Taal town in Aleppo countryside with artillery. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes struck targets and houses in Mukhayyam Jabalya refugee camp (North Gaza, Gaza Strip), killing 5 persons and injuring dozens. Also a number of Palestinians were injured after targeting an UNRWA school hosting refugees."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, Israeli gunboats shelled the Coast of Khan Yunis (Khan Yunis, Gaza Strip). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, an IED planted by Al Shabaab detonated, targeting civilians in a teashop in Halgan village (Bulo Burto, Hiraan), resulting in a person getting killed and unknown others wounded."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli fighter jets struck the outskirts of Ras al Naqoura (Tyr). There were no casualties."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, regime forces shelled Al-Sirmaniyah town in Hama countryside with heavy artillery. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, regime forces shelled the eastern outskirts of Idleb city with heavy artillery. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes struck houses in Khan Yunis refugee camp, west of Khan Yunis in the area of Khan Yunis - West (Municipal Stadium) (Gaza Strip). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes carried out airstrikes in al-Muhararat area northwest of Rafah (Rafah, Gaza Strip). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Kostiantynivka, Donetsk. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Vovchansk, Kharkiv. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, SAF shelled artillery targeting RSF in Khartoum - Al Jarif West (Khartoum, Khartoum). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes carried out airstrikes north of Al Maghazi (Deir El Balah, Gaza Strip). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli military forces fired a precision guided missile towards the forests of Qouzah (Bint Jbeil). There were no casualties."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes struck houses in Gaza - Tal el Hawa (Gaza City, Gaza Strip), leaving an unspecified number of fatalities and injuries. Fatalities coded as 10."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes struck al-Shawwa Square in Gaza - Ad Darraj (Gaza City, Gaza Strip), leaving an unspecified number of fatalities and injuries and killing a Palestinian journalist. Fatalities coded as 10."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, SAF air-raids targeted 22nd SAF Infantry Division by mistake in Babanussa (Babanusa, West Kordofan). A SAF soldier was wounded."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Hostre, Donetsk. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Vodyane, Donetsk. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, AAMB militants threw an explosive device at Israeli army vehicles in Al Yamun town (Jenin, West Bank). There were no casualties."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Urozhaine, Donetsk. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes and artillery struck targets east of Al Qararah (Khan Yunis, Gaza Strip). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Turkish airstrikes targeted 16 PKK positions in the Chiya-e Gara, Metina, Wadi Khakurik, and Silsilat Jibal Qandil regions of Erbil and Duhok. 1 event coded for each location. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, regime forces shelled Kafr Oweid town in Idleb countryside with artillery. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Temyrivka, Zaporizhia. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Turkish airstrikes targeted 16 PKK positions in the Chiya-e Gara, Metina, Wadi Khakurik, and Silsilat Jibal Qandil regions of Erbil and Duhok. 1 event coded for each location. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Bohdanivka, Donetsk. A civilian was wounded."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Ternova, Kharkiv. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes struck targets and houses in An Nusayrat refugee camp (Deir El Balah, Gaza Strip), leaving an unspecified number of fatalities and injuries, likely civilians. Also, the artillery struck targets in the area. Fatalities coded as 10."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli warplanes struck houses in Yibna refugee camp (Rafah, Gaza Strip). 9 Palestinians were killed."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Turkish airstrikes targeted 16 PKK positions in the Chiya-e Gara, Metina, Wadi Khakurik, and Silsilat Jibal Qandil regions of Erbil and Duhok. 1 event coded for each location. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Novodanylivka, Zaporizhia. There were no casualties."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli artillery and tanks shelled the Coast of Gaza City (Gaza City, Gaza Strip). Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Israeli military forces shelled Hamoul valley south of Ras al Naqoura (Tyr). There were no casualties."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, a drone by unknown military forces conducted an airstrike targeting a pro-Iranian military positions in Ain Ali area in Mahkan badia in Deir ez Zor countryside. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 30 November 2023, Turkish warplanes carried out an air strike in the vicinity of Xanke (Khankah) village in Metina region of Dahuk province. Casualties unknown."}
{"label":"Explosions\/Remote violence","text":"On 1 December 2023, Russian military forces shelled Chervone, Zaporizhia. There were no casualties."}
{"label":"Protests","text":"On 1 December 2023, for the eight consecutive week, at the call of the Moroccan Commission for the Support of the Islamic Nation Causes, worshippers demonstrated following the Friday prayer at two mosques in Berrechid (Berrechid, Casablanca-Settat) in support to Palestine and to denounce Israeli military operations in Gaza and Morocco's normalization with Israel."}
{"label":"Protests","text":"On 1 December 2023, students organized by the coordinating student committee of the fine art and performance schools of Attica protested in Syntagma square, Athens - Central Athens, with dance and music, over the lack of infrastructure and other major problems they face."}
{"label":"Protests","text":"On 1 December 2023, protesters held large Houthi-sponsored protest stands in the district centers of Raymah governorate, namely in Al Hadiyah (Al Jafariyah), Ad Dil (As Salafiyah), Markaz Bilad At Taam (Bilad At Taam), Kusmah (Kusmah), and Mazhar (Mazhar) in solidarity with the Palestinian people and 'resistance' and in support of the Houthi leadership decisions and to denounce the 'crimes of the Zionist entity' in the context of the latest round of violence in Israel-Palestine."}
{"label":"Protests","text":"On 1 December 2023, members of the Samsun KHK (Decree Law) Victims Platform staged a demonstration in front of the courthouse in Ilkadim, Samsun, to protest the non-implementation of the decision of the European Court of Human Rights (ECHR)."}
{"label":"Protests","text":"On 1 December 2023, members of SEIU Local 668 and Healthcare Pennsylvania gathered in front of a county-owned nursing home in Greensburg (Pennsylvania) to demand that the county propose a fair labor contract, including cost of living increases and addressing understaffing."}
{"label":"Protests","text":"On 1 December 2023, a group of citizens gathered in El Cenizo (Texas) to protest for emergency services for the city and to protest against the current mayor, Carina Hernandez, hiring the former mayor, Raul Reyes, as a consultant."}
{"label":"Protests","text":"On 1 December 2023, Fridays For Future activists, led by Greta Thunberg, demonstrated in front of the Parliament of Sweden in Stockholm to draw attention to environmental problems and to advocate for a 'free Palestine'."}
{"label":"Protests","text":"On 30 November 2023, the local antenna of the ANDCM held a protest sit-in in front of the prefecture of Imilchil (Midelt, Draa-Tafilalet) calling authorities to offer them job opportunities."}
{"label":"Protests","text":"On 1 December 2023, residents blocked the entrance leading to the office of the municipality manager by locking the gate in Malaba (Teso North, Busia) against appointment of a new manager. Led by human rights defenders, the group demanded the Senator to help address the matter among others."}
{"label":"Protests","text":"On 30 November 2023, residents of Siria area marched to the office of the interior cabinet secretary, before proceeding to the Ethics and Anti-corruption (EACC) offices in Nairobi (Starehe, Nairobi) against interference in community land, fanning of ethnic clashes, and abuse of office by their area Deputy County Commissioner (DCC). Led by Lolgorian Ward (Jubilee, Azimio) and Kimintet Ward (CCM, Kenya Kwanza), members of county assembly, the group demanded the DCC dismissed."}
{"label":"Protests","text":"On 1 December 2023, farmers from the Korean Peasants League Gangwon branch held a press conference and picketed in front of Gangwon Provincial Office (Chuncheon). They urged the authorities to increase the budget for the agricultural industry."}
{"label":"Protests","text":"On 1 December 2023, around 60 Papuan students from the AMP organization peacefully protested in front of the US Embassy and the Arjuna Wijaya monument in Central Jakarta city (Jakarta province) (coded as Jakarta - Central). They demanded Papua's independence and the closure of PT Freeport mining company in Papua."}
{"label":"Protests","text":"On 1 December 2023, IHD members and executives staged a demonstration in front of IHD office in Batman town, in protest of the prison policies which prevent ill prisoners from accessing adequate health service."}
{"label":"Protests","text":"On 1 December 2023, 200 people, including a Women's Safety Commissioner, marched in Ballina, New South Wales against domestic and family violence."}
{"label":"Protests","text":"On 1 December 2023, about 40 people, including members of the 'Judische Hochschulgruppe Bonn' (Jewish University Group Bonn), 'Liberale Hochschulgruppe' (Liberal University Group) and DIG participated in a pro-Israel protest at Hofgartenwiesen in Bonn (Nordrhein-Westfalen) against hostility towards Jews and for the release of the Hamas hostages."}
{"label":"Protests","text":"On 30 November 2023, in Santa Cruz de la Sierra (Santa Cruz), for the second consecutive day, merchants at Mutualista market blocked the street around the market in an ongoing problem of relocation of merchants that were displaced by the reconstruction works of the market, that has caused them to place their shops on the parking grounds."}
{"label":"Protests","text":"On 30 November 2023, in Lambayeque (Lambayeque), dozens of teachers of the Pedro Ruiz Gallo National University (UNPRG) blocked the North Pan American highway at the entrance of the city as a demonstration to demand the central government the leveling of salaries of all teachers."}
{"label":"Protests","text":"On 1 December 2023, pro-Palestinian protesters gathered outside the White House in Washington DC - National Mall (District of Columbia) to support a permanent ceasefire between Israel and Hamas. Protesters were on their fifth and final day of a hunger strike organized by the Adalah Justice Project (Palestinian organization), Jewish Voice for Peace, Dream Defenders, the US Campaign for Palestinian Rights, and IfNotNow to support the cause. Delaware state representative Madinah Wilson-Anton (D) participated in the protest. The APWU President (affiliated with AFL-CIO) and UAW Region 9 Director spoke in favor of a ceasefire at the event. The demonstration took place in the wake of renewed fighting between Israel and Hamas."}
{"label":"Protests","text":"On 1 December 2023, in San Juan De Pasto (Narino), members of a labor union protested against the election of the new director of the Narino Regional Autonomous Corporation (Corponarino) outside the premises of the institution. They claimed there were irregularities in the selection process."}
{"label":"Protests","text":"On 1 December 2023, in Chilpancingo de los Bravo, Guerrero, women workers from the city council who have been part of an independent union held a protest against harassment carried out by the central administration. The protesters also denounced that their salaries had been withheld."}
{"label":"Protests","text":"On 1 December 2023, protesters held large Houthi-sponsored protest stands in the district centers of Raymah governorate, namely in Al Hadiyah (Al Jafariyah), Ad Dil (As Salafiyah), Markaz Bilad At Taam (Bilad At Taam), Kusmah (Kusmah), and Mazhar (Mazhar) in solidarity with the Palestinian people and 'resistance' and in support of the Houthi leadership decisions and to denounce the 'crimes of the Zionist entity' in the context of the latest round of violence in Israel-Palestine."}
{"label":"Protests","text":"On 1 December 2023, at the call of Rape is Rape, around 50 feminist activists gathered outside the UNESCO headquarters in Paris (Ile-de-France) to urge the UN to consider the rape of Israeli women by Hamas fighters a 'war crime'. They also accused other French feminist organizations, including Nous Toutes, of double standards when condemning violence against women. A minute's silence was held in solidarity with the victims of the 7 October 2023 Hamas attack."}
{"label":"Protests","text":"On 1 December 2023, in Santa Cruz de la Sierra (Santa Cruz), for the third consecutive day, merchants at Mutualista market blocked the street around the market in an ongoing problem of relocation of merchants that were displaced by the reconstruction works of the market, that has caused them to place their shops on the parking grounds."}
{"label":"Protests","text":"On 30 November 2023, protesters including activists from Mouttahidoun and the Association for Lebanese depositors held a protest outside the Military Tribunal Court in Beirut - Mazraa (Beirut), to demand the release of a detained depositor who had stormed a bank."}
{"label":"Protests","text":"On 1 December 2023, people protested in Wollongong, New South Wales, calling on an MP to stop 'car crash' policies on coal."}
{"label":"Protests","text":"On 1 December 2023, local residents, including Muslim worshipers, staged a rally in Bojnurd city (North Khorasan) to support Palestinians and to condemn 'the crimes of the Zionist regime.'"}
{"label":"Protests","text":"On 30 November 2023, a protest was held in front of Al Mukataa building in Ramallah (Ramallah and Al Bireh, West Bank) against the American minister of foreign affairs' visit to the Mukataa due to America's support of Israel in the war."}
{"label":"Protests","text":"On 1 December 2023, demonstrators held Houthi-sponsored marches in the districts of Al Hazm and Al Maton (coded to Al Matun) (Al Jawf) in solidarity with the Palestinian people and to denounce the 'crimes of the Zionist enemy' in the context of the latest round of violence in Israel-Palestine."}
{"label":"Protests","text":"On 1 December 2023, in Rawson (Chubut), members of the Union of Civil Personnel of the Nation (UPCN) protested at the Ministry of Labor to demand compliance with a collective agreement of the 1987 Law."}
{"label":"Protests","text":"On 1 December 2023, a group of students peacefully protested in front of the US Embassy in Central Jakarta city (Jakarta province) (coded as Jakarta - Central). They showed support for Palestine in the Palestine-Israel conflict. They also condemned the occupation of Palestinian territory by Israel and the US support of Israel."}
{"label":"Protests","text":"On 1 December 2023, hundreds of Imo women protested at the INEC State headquarters in Owerri (Owerri Municipal, Imo) over the delay in releasing the certified true copies (CTC) of the governorship election. The women dressed in black attires were drawn from the three senatorial areas of the state. They lamented the delay had caused anguish for the people."}
{"label":"Protests","text":"On 1 December 2023, protesters held a Houthi-sponsored demonstration in Damt district (coded to Hammam Damt) (Ad Dali) in solidarity with the Palestinian people and to denounce the 'crimes of the Zionist enemy' in the context of the latest round of violence in Israel-Palestine. Houthi-affiliated political officials took part in the demonstration."}
{"label":"Protests","text":"On 1 December 2023, pro-Palestinian protesters, including members of CAIR, Neturei Karta (Jewish group), and other rabbis, gathered in front of the Israeli Embassy in Washington DC - Northwest (District of Columbia) to condemn violence in Gaza, US support of Israel, and what some demonstrators referred to as 'genocide.' Some demonstrators condemned President Biden. The demonstration took place in the wake of renewed fighting between Israel and Hamas."}
{"label":"Protests","text":"On 1 December 2023, in Ciudad de Mexico - Venustiano Carranza, unionized teachers from 20 schools of the Colegio de Bachilleres held a protest around the international airport and blocked several parts of the city and the state of Mexico (coded separately) demanding a salary increase of 20 percent and better working conditions."}
{"label":"Protests","text":"On 1 December 2023, for the eight consecutive week, at the call of the Moroccan Commission for the Support of the Islamic Nation Causes, worshippers demonstrated following the Friday prayer in Berkane (Berkane, Oriental) in support to Palestine and to denounce Israeli military operations in Gaza and Morocco's normalization with Israel."}
{"label":"Protests","text":"On 1 December 2023, locals, including relatives of a deceased man, staged a protest at the East-West highway in Lamki village (Kailali district), following the death of the man after being hit by a bus in an accident. The protesters were also demanding compensation following the death of the man."}
{"label":"Protests","text":"On 30 November 2023, in Zulia state (coded to Maracaibo), demonstrators protested with unspecified demands on issues related to land rights, and political participation."}
{"label":"Protests","text":"On 1 December 2023, around 100 students' parents took to the streets in Ponerihouen (North) to demand more attention to security measures for students outside and inside school facilities from municipal authorities."}
{"label":"Protests","text":"On 1 December 2023, Labor and Democracy staged a demonstration in front of KESK office in Artuklu, Mardin, to protest the dismissal of members of the Central Council of the TTB from their positions. Representatives of KESK and TTB attended the protest."}
{"label":"Protests","text":"On 1 December 2023, hundreds of students peacefully protested in front of the Abdul Aziz Lamadjido University in Palu city (Central Sulawesi province). They opposed the 'political dynasty' built by the current president."}
{"label":"Protests","text":"On 1 December 2023, dozens of people from nearby villages staged a protest, raising slogans, outside the police station in Surir town (Mathura, Uttar Pradesh) demanding action against the people arrested by the police whom the protesters accused of poisoning and killing cattle in the area."}
{"label":"Protests","text":"Around 1 December 2023 (as reported), a group of Junior Secondary School (JSS) intern teachers from Kiambu gathered in Kiambu town (Kiambu Town, Kiambu) against the move by the government not to honor their employment agreement. Joined by Kenya Union of Post Primary Education Teachers (KUPPET) representatives, the group demanded the Teacher Service Commission (TSC) to address the matter as well as the government to consider domiciling the JSS to secondary schools."}
{"label":"Protests","text":"On 1 December 2023, for the eight consecutive week, at the call of the Moroccan Commission for the Support of the Islamic Nation Causes, worshippers demonstrated following the Friday prayer in Zaio (Nador, Oriental) in support to Palestine and to denounce Israeli military operations in Gaza and Morocco's normalization with Israel."}
{"label":"Protests","text":"On 30 November 2023, in Riohacha (La Guajira), relatives of a woman victim of femicide protested to demand justice. They said that the perpetrator is about to get out of jail based on the expiration of legal deadlines. They demanded a change in the prosecutor leading the process."}
{"label":"Protests","text":"On 1 December 2023, protesters held large a Houthi-sponsored demonstration in Al Jabin (Al Jabin, Raymah) in solidarity with the Palestinian people and 'resistance' and in support of the Houthi leadership decisions and to denounce the 'crimes of the Zionist entity' in the context of the latest round of violence in Israel-Palestine. Houthi-affiliated political officials took part in the demonstration."}
{"label":"Protests","text":"On 1 December 2023, the family of prominent political figure Hasan Mushaima held a protest stand in front of the Kano Health Center in Riffa (Southern) after he announced a hunger strike calling for the provision of adequate treatment for him."}
{"label":"Protests","text":"Around 1 December 2023 (as reported), a group of junior secondary school intern teachers gathered at unspecified location within Migori county (coded to the county headquarters as Migori (Suna West, Migori) against the move by the government not to honor their employment agreement. The group demanded permanent and pensionable employment terms."}
{"label":"Protests","text":"Around 1 December 2023 (as reported), inspectors held a protest sit-in in front of the Ministry of Education in Rabat (Rabat, Rabat-Sale-Kenitra) calling for the independence of their profession."}
{"label":"Protests","text":"On 1 December 2023, more than 20 residents of Yuancheng township, led by the vice chairman of the township congress and the mayor of Longyan village, gathered to protest with banners in Yuanchang township (Yunlin). They opposed the planned construction of a pig slaughterhouse in Yuanchang township, arguing that it would lead to environmental pollution and a reduced quality of life."}
{"label":"Protests","text":"On 30 November 2023, protesters continued to demonstrate at the camp in Makhmur, Erbil, to protest the isolation PKK leader Abdullah Ocalan is subjected to."}
{"label":"Riots","text":"On 1 December 2023, in Bogota - Teusaquillo (Bogota, D.C.), a group of hooded demonstrators (likely students) clashed with UNDMO officers outside the National University on NQS Avenue with 45th Street. The reasons behind the demonstration are unknown."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces during an Israeli raid in Al Manshiyah village (Bethlehem, West Bank). Israeli forces fired tear gas canisters. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, in Ciudad de Mexico - Miguel Hidalgo, dozens of activists advocating for HIV patients set fire on fire the main entrance of the building of the National Center for the Prevention and Control of HIV and AIDS (Censida) to denounce the shortage of medicines. The event took place within the framework of World AIDS Day. The people also threw stones at the building, painted and painted the windows."}
{"label":"Riots","text":"On 30 November 2023, Palestinian rioters clashed with Israeli forces that raided Yatma (Nablus, West Bank). There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces during an Israeli raid in Bayt Fajjar town (Bethlehem, West Bank). There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, rioters clashed with police on Haboubi Square, Nassriya city. The clashes damaged police vehicles and injured 2 policemen. The riot was triggered by the arrests of 3 people accused of blackmail and tearing down electoral posters."}
{"label":"Riots","text":"Around 1 December 2023 (as reported), residents stormed Sihayi police post, before proceeding to set ablaze a house of a suspected killer in the village then made their way back to the trading center, where they set fire to a portion of the liquor store (coded as Sihayi, Ugenya, Siaya) after the suspected killing of a man. The group demanded to understand the circumstances surrounding the man's murder as well as why police did not notify relatives before transferring the body to the mortuary."}
{"label":"Riots","text":"On 1 December 2023, hundreds of Muslim students from the PMII student organization held a demonstration in front of the city hall in Tasikmalaya city (West Java province). They voiced various concerns, including the level of poverty in the city and the corruption within the local government. They threw plastic bottles and potted plants at the city hall. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces in Baytunya town (Ramallah and Al Bireh, West Bank). Palestinian rioters threw rocks and Israeli forces fired live and rubber bullets, stun grenades, and tear gas canisters. The clashes erupted after a number of Palestinians had gathered in Baytunya to receive Palestinian prisoners released from Israeli prisons as part of the exchange of the Israeli hostages for Palestinian prisoners deal. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, armed Israeli settlers, accompanied by Israeli forces, attacked Palestinian farmers and shepherds in Mosafer Yuta area east of Yuta town (Hebron, West Bank) and forced them to leave the land. There were no casualties."}
{"label":"Riots","text":"On 30 November 2023, villagers assaulted and killed a tea seller in Golabaria village, Gopalganj Sadar (Gopalganj, Dhaka), on suspicion of being a thief."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces during an Israeli raid in Madama village (Nablus, West Bank). Palestinian rioters threw rocks and Israeli forces fired live and rubber bullets, stun grenades and tear gas canisters, injuring a Palestinian man. There were no fatalities."}
{"label":"Riots","text":"On 30 November 2023, Israeli settler rioters hurled stones at Palestinian vehicles near Jit (Qalqilya, West Bank) as they were passing by."}
{"label":"Riots","text":"On 1 December 2023, rioterm likely vigilantes, clashed with police forces after attacking the homes of Afghan nationals in Meybod city (Yazd) after news circulated reporting the arrest of an Afghan suspected in the murder of an Iranian young man the night before."}
{"label":"Riots","text":"On 1 December 2023, a NANS faction invaded the National Hospital, Abuja (Abuja Municipal, Federal Capital Territory) to attack the injured members of another faction who were undergoing treatment. The panic forced other patients to flee their wards. The police intervened and dispersed them."}
{"label":"Riots","text":"Around 1 December 2023 (as reported), campus security guards assaulted some law students of Mahatma Gandhi Antarashtriya Hindi Vishwavidyalaya (MGAHV) in Wardha city (Maharashtra) during a demonstration over apprehensions that the LLB court at the university was not accredited with the Bar Council of India (BCI). The dean claimed that students had assaulted teachers, including female faculty, and security guards intervened to protect the staff."}
{"label":"Riots","text":"On 30 November 2023, Palestinian rioters clashed with Israeli forces that raided Burham (Ramallah and Al Bireh, West Bank). Israeli forces fired rubber-coated bullets, tear gas canisters, and stun grenades to disperse the rioters. A Palestinian child was injured."}
{"label":"Riots","text":"On 1 December 2023, tens of rioters organized a demonstration in front of Al Baath party branch in Shahba town in As Sweida countryside, and raided the branch and destroyed all photos and items inside."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces during an Israeli raid in Jenin city (West Bank). Palestinian rioters threw rocks and Israeli forces fired live and rubber bullets, stun grenades and tear gas canisters. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, in Flores (Pernambuco), a group of people blocked the BR-232 highway after an accident that killed 2 people and injured 4. The group burned objects on the road and demanded the installation of electronic monitoring on the highway."}
{"label":"Riots","text":"On 30 November 2023, at least 200-300 supporters of Awami League nominated candidate and an Independent candidate clashed in Naria upazila (Shariatpur, Dhaka), over electoral rivalry, ahead of upcoming general elections. Several crude bombs were exploded and at least 8 people were injured in the clash."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces during an Israeli raid in Mukhayyam al Arrub (Hebron, West Bank). Palestinian rioters threw hand made explosives and Molotov cocktails. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces during an Israeli raid in Siir town (Hebron, West Bank). Israeli forces fired live bullets, injuring a Palestinian minor. There were no fatalities."}
{"label":"Riots","text":"On 1 December 2023, Israeli settlers threw rocks at passing Palestinian cars near Ariel settlement (Salfit, West Bank), causing material damages only. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, Israeli settlers raided a Palestinian-owned restaurant near As Sawiyah town (Nablus, West Bank). The settlers threw rocks at the restaurant and broke into it, causing material damages and stealing some of its contents. There were no casualties."}
{"label":"Riots","text":"On 30 November 2023, residents barricaded the Namanga highway with bonfires at the Duka Moja area (coded as Namanga, Kajiado Central, Kajiado) in demonstration against increased road accidents. Police used unspecified means to disperse the group."}
{"label":"Riots","text":"On 1 December 2023, Baggara tribal militiamen burned a QSD center in Kasra town in Deir ez Zor countryside, after the killing of two young men."}
{"label":"Riots","text":"On 30 November 2023, Israeli settler rioters uprooted 10 olive trees and attacked Palestinian farmers in Kafr ad Dik (Salfit, West Bank) as they were harvesting olives. There were no fatalities."}
{"label":"Riots","text":"On 30 November 2023, Awami League nominated candidate, who is also a current MP, and his supporters assaulted three journalists and vandalized their equipment at DC office in Chittagong city (Pahartali), as the journalists questioned about violation of electoral code of conduct during submission of nomination papers."}
{"label":"Riots","text":"On 30 November 2023, Palestinian rioters clashed with Israeli forces near the Umar Ibn al Khattab mosque in Mukhayyam al Arrub refugee camp (Hebron, West Bank)."}
{"label":"Riots","text":"On 1 December 2023, around 100 armed Israeli settlers raided Arab al Ka'abinah town (Jericho, West Bank). The settlers attacked a Bedouin settlement, threw rocks at its residents and told them that they had to flee the area. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, Israeli settlers, under the protection of Israeli forces, raided Qaryut village (Nablus, West Bank) and clashed with Palestinians. Israeli forces fired at Palestinian farmers, injuring one of them. There were no fatalities."}
{"label":"Riots","text":"On 1 December 2023, Palestinian demonstrators clashed with Israeli forces during a Palestinian demonstration in Maythalun town (Jenin, West Bank) against settlement expansion and in support of Gaza against Israeli attacks. Palestinian rioters threw rocks and Israeli forces fired live and rubber bullets, stun grenades, and tear gas canisters, injuring 2 Palestinians. There were no fatalities."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces in Ain al Saltan refugee camp (Jericho, West Bank). Palestinian rioters threw rocks and explosives and Israeli forces fired stun grenades, and tear gas canisters. There were no casualties."}
{"label":"Riots","text":"Around 1 December 2023 (as reported), the Ngbo youths attacked and beat the Ajile traders in the Okwo-ngbo market in the Ngbo community (Ohaukwu, Ebonyi) for unclear reasons. There was panic in the market, and the traders deserted, fearing the attack could reignite a hundred-year-old communal clash that had just been resolved between the two communities."}
{"label":"Riots","text":"On 30 November 2023, in Port-au-Prince - Petionville, Ouest, residents held a demonstration in Laboule 12 to decry the killing of young man by a military officer the day before (coded separately). Demonstrators burned tires on the road."}
{"label":"Riots","text":"On 30 November 2023, Israeli settler rioters hurled stones at Palestinian vehicles on Road 90 near Jericho (Jericho, West Bank) as they were passing by."}
{"label":"Riots","text":"On 30 November 2023, Standard Group employees attacked a group of auctioneers at Standard Group Centre on Mombasa Road in Nairobi (Starehe, Nairobi) for seizing company valuables. It is unclear whether the auctioneers sustained injuries as they were rescued by the group chief executive officer."}
{"label":"Riots","text":"On 30 November 2023, unidentified men exploded four crude bombs at DC office in Segunbagicha, Dhaka - Ramna (Shahbagh), when candidates for upcoming general elections were submitting their nomination papers."}
{"label":"Riots","text":"On 30 November 2023, two factions of Chhatra League (BCL) clashed in Natunbazar area, Nabiganj upazila (Habiganj, Sylhet), during the submission of nomination papers for Awami League candidate, ahead of upcoming general elections. At least 10 people were injured in the clash."}
{"label":"Riots","text":"On 1 December 2023, Israeli settlers raided Palestinian homes in At-Tuba town (Hebron, West Bank) and told their residents that they have to flee the area. There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, police officers fired several shots inside their camp of Djibo (Djibo, Soum) to express their dissatisfaction with their hierarchy. This anger was due in particular to the delays in relieving them. Supposed to be deployed for six months, they are now eight months without relief."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters threw homemade explosives at Israeli forces at the entrance of Bayt Ummar town (Hebron, West Bank). There were no casualties."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters threw rocks at an Israeli settler's car near Al Lubban ash Sharqiyah (Nablus, West Bank), causing material damages. There were no casualties."}
{"label":"Riots","text":"On 30 November 2023, Palestinian rioters clashed with Israeli forces at the entrance of Silat al Harithiyah (Jenin, West Bank). Palestinian rioters also targeted the Israeli forces with pipe bombs."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters clashed with Israeli forces during an Israeli raid in Tuqu town (Bethlehem, West Bank). Palestinian rioters threw rocks and Israeli forces fired live and rubber bullets, stun grenades, and tear gas canisters. 1 Israeli soldier sustained an injury. There were no fatalities."}
{"label":"Riots","text":"On 30 November 2023, in Ciudad de Mexico - Coyoacan, a group of students from High School 5 'Josa Vasconcelos' marched from the sculpture known as 'Los Bigotes' to the UNAM Rectory Tower. The participants threw gasoline at the main door and set it on fire. The students demanded the dismissal of the director, as they accuse him for not addressing the demands of sexual harassment of young people."}
{"label":"Riots","text":"On 1 December 2023, Palestinian rioters threw rocks at an Israeli settler's car in Turmus Ayya town (Ramallah and Al Bireh, West Bank). There were no casualties."}
{"label":"Riots","text":"On 30 November 2023, Israeli settler rioters hurled stones at Palestinian vehicles near Dayr Sharaf (Nablus, West Bank) as they were passing by on the Nablus-Tulkarm road."}
{"label":"Riots","text":"On 30 November 2023, a group of people led by human rights activist took to the streets in Mangochi (Mangochi, Southern) against the recent kwacha devaluation and several socioeconomic issues faced by Malawians. They chanted songs demanding president Lazarus Chakwera's resignation. Rioters threw stones at police officers, shops, 12 police motor vehicles and set on fire sign posts and kiosks. They burned tires and invaded the district education offices where they damaged window glasses. Police officers used tear gas to disperse the crowd. They arrested 45 people and charged them with malicious damage and inciting violence."}
{"label":"Strategic developments","text":"Non-violent activity: On 1 December 2023, US forces conducted maneuvers using armed drone boats in the Persian Gulf to ensure maritime security in the region amid the targeting of commercial ships in the Gulf and the Red Sea."}
{"label":"Strategic developments","text":"On 1 December 2023, in Michoacan state (coded to Morelia), the National Guard and officers of the National Migration Institute detained 52 migrants travelling from Mexico City to Guadalajara. Most of the migrants were from Haiti."}
{"label":"Strategic developments","text":"Property destruction: On 1 December 2023, in Mya Kone village (Pale township, Yinmarbin district, Sagaing region), the Myanmar military raided the village and set fire to houses after clashing with the local People's defense force near the village (coded separately)."}
{"label":"Strategic developments","text":"On 30 November 2023, at least 150 former militiamen (mostly FPP\/AP-Kabidon and UPLC of Janvier Mayani) in Lubero territory surrendered and signed an individual act a few days ago at the Kasando disarmament center, south Lubero (Baswaga, Lubero, Nord-Kivu) to declare their 'disengagement from armed groups' while waiting reintegrating into the community as part of the Disarmament, Demobilization, Community Reintegration, and Social reintegration Program (PDDRC-S)."}
{"label":"Strategic developments","text":"Displacement: Around 30 November 2023 (as reported), The Kamuronza civil society reported that more than 6000 new displaced households have arrived in Sake (Bahunde, Masisi, Nord-Kivu) after fleeing the intensification of clashes between Wazalendo and M23 around Kilolirwe for the past two weeks. They have come from villages such as Kingi, Katembo, Tonane, Karenga, Kisingati, and others. In the town of Sake, they are scattered across four spontaneous sites: Kizimba, Zaina, Kyabiringa, and Mahyutsa, among others. Others are located in collected centers of EP Kamuronza and Kiluku Institute. Some living with host families."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward southern Israel, causing sirens to sound in Holit (Beer Sheva, HaDarom) and surrounding areas. Not all of the rockets hit populated areas, as some were intercepted over the area of Holit or fell in open areas."}
{"label":"Strategic developments","text":"Movement of forces: On 30 November 2023, US forces conducted a military patrol in Rmelan town in Al Hasakeh countryside."}
{"label":"Strategic developments","text":"On 30 November 2023, regime General Intelligence Directorate and State Security patrol members detained a business man for unknown reasons while on his way to Homs city."}
{"label":"Strategic developments","text":"Other: Around 1 December 2023 (as reported), Patriot Front Network 17 affiliates dropped a banner near Mount Olympus in Millcreek (Utah) that read 'merchants have no nations' and promoted the group."}
{"label":"Strategic developments","text":"Weapons seizure: On 30 November 2023, Baghdad Operations Command discovered and destroyed an IS weapons cache in Abu Ghraib district, Baghdad. The cache contained 33 mortars, an unspecified number of rockets, and specified number of rocket launchers, and other unspecified war materiel."}
{"label":"Strategic developments","text":"Security measures: On 1 December 2023, Israeli forces blocked the entrances of Al Quds - Sur Bahir village (Al Quds, West Bank) with concrete blocks. Residents announced a strike that would include not sending their children to schools."}
{"label":"Strategic developments","text":"Security measures: On 1 December 2023, extensive deployment of military forces was reported on the streets around the Jameh Mosque of Makki in Zahedan city (Sistan and Baluchestan) to prevent potential protests and gatherings."}
{"label":"Strategic developments","text":"Non-violent activity: Around 1 December 2023 (as reported), the Clockwork Crew distributed antisemitic fliers in Los Angeles - Westside (California) with messages promoting Clockwork Crew (loosely affiliated with the Rise Above Movement)."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward central Israel, causing sirens to sound in Rishon LeZion (Rehovot, HaMerkaz) and surrounding areas. Not all of the rockets hit populated areas, as several were intercepted over the area of Rishon LeZion or fell in open areas."}
{"label":"Strategic developments","text":"Property destruction: On 30 November 2023, following the protest, the Joint Task Force (coded as the police) raided the Mayigi Community High School, Ilashe (Ipokia, Ogun). They destroyed property worth millions of naira and threatened the school teachers and students with guns."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward central Israel, causing sirens to sound in Rehovot (HaMerkaz) and surrounding areas. Not all of the rockets hit populated areas, as several were intercepted over the area of Rehovot or fell in open areas."}
{"label":"Strategic developments","text":"Around 30 November 2023 (between 16 - 30 November), Turkish police, gendarmerie and coast guard detained and captured 1573 migrants, who entered Turkey illegally, in Mugla province."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Ukrainian military forces intercepted 20 Russian kamikaze-drones and 2 missiles across Kherson, Zaporizhia, Dnipropetrovsk and Mykolaiv regions (coded to Dnipro, Dnipropetrovsk)."}
{"label":"Strategic developments","text":"Other: On 30 November 2023, an INGO evacuated its personnel from Nampala to Niono (Niono, Segou), citing insecurity in the area."}
{"label":"Strategic developments","text":"Other: On 30 November 2023, in San Salvador, San Salvador, the Legislative Assembly granted a six-month leave of absence to the President, so that he may dedicate himself to the electoral campaign. In addition, they designated the President's private secretary as the person in charge to rule for the upcoming six-months."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Ukrainian military forces intercepted a Russian kamikaze-drone near Zaporizhia, Zaporizhia."}
{"label":"Strategic developments","text":"Land seizure: On 30 November 2023, Israeli forces turned a Palestinian-owned home to a military outpost in Khirbat Karme (Hebron, West Bank) after forcing its residents to evacuate the house."}
{"label":"Strategic developments","text":"Property destruction: On 1 December 2023, Israeli settlers damaged Palestinian-owned greenhouses in Bardalah village (Tubas, West Bank)."}
{"label":"Strategic developments","text":"Defusal: On 1 December 2023, police officials recovered and safely detonated a landmine planted by CPI (Maoists) on the Bestha Kothur and Chinna Midiseleru main road in Cherla village (Bhadradri Kothagudem, Telangana) in an attempt to stop the polling for the Telangana state assembly elections. Police detonated the 40 kg landmine after the polling."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward southern Israel, causing sirens to sound in Sderot (Ashqelon, HaDarom) and surrounding areas. Not all of the rockets hit populated areas, as some were intercepted over the area of Sderot or fell in open areas."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward southern Israel, causing sirens to sound in Netivot (Beer Sheva, HaDarom) and surrounding areas. Not all of the rockets hit populated areas, as some were intercepted over the area of Netivot or fell in open areas."}
{"label":"Strategic developments","text":"Movement of forces: On 30 November 2023, Houthi forces deployed to Mansam (Ash Sharyah, Al Bayda) and set up missile launch pads and artillery stations."}
{"label":"Strategic developments","text":"Around 1 December 2023 (as reported), Turkish gendarmerie forces arrested 52 migrants, who entered Turkey illegally, in Kars town."}
{"label":"Strategic developments","text":"On 1 December 2023, regime forces detained a man after raiding his house in Maaraba town in rural Damascus for unknown reasons."}
{"label":"Strategic developments","text":"Training: Around 1 December 2023 (as reported), Patriot Front Network 3 affiliates held a sparring training in Casper (Wyoming)."}
{"label":"Strategic developments","text":"Other: On 30 November 2023, Engineers working for RSF built a bridge across a boat lock on Jabal Aulia dam (Jebel Awlia, Khartoum), after the bridge was bombed on 18 November (coded separately)."}
{"label":"Strategic developments","text":"Displacement: On 30 November 2023, population displacement has intensified over the past week in the Masisi territory (Osso, Masisi, Nord-Kivu) following clashes between M23 and FARDC. Residents of villages surrounding Muhanga and Kibatsiro are heading towards Mukoto Monastery, Kahira, and Kirumbu, while those from the Nyamitaba area are moving towards Muheto, and others are going as far as Sake."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward southern Israel, causing sirens to sound in Saad (Beer Sheva, HaDarom) and surrounding areas. Not all of the rockets hit populated areas, as some were intercepted over the area of Saad or fell in open areas."}
{"label":"Strategic developments","text":"Defusal: On 30 November 2023, unknown militants placed a hand grenade and a threatening note in the garden of the General Director of Thi Qar Health in Nassriya city. The note demanded his resignation. Local police safely removed the grenade."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward southern Israel, causing sirens to sound in Kefar Azza (Ashqelon, HaDarom) and surrounding areas. Not all of the rockets hit populated areas, as some were intercepted over the area of Kefar Azza or fell in open areas."}
{"label":"Strategic developments","text":"Movement of forces: On 30 November 2023, Houthi forces deployed to Al Jadafir (Al Hazm, Al Jawf) and Al Alamayn (coded to Al Alam al Abyad) (Khabb wa Ash Shaaf, Al Jawf). The source claimed that the forces would be heading to the Marib fronts."}
{"label":"Strategic developments","text":"Property destruction: On 30 November 2023, Israeli forces demolished 5 Palestinian-owned residential rooms, 5 water containers, solar panels, and electricity and water lines in Firasin (Jenin, West Bank)."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward central Israel, causing sirens to sound in Modiin (Ramla, HaMerkaz) and surrounding areas. Not all of the rockets hit populated areas, as several were intercepted over the area of Modiin or fell in open areas."}
{"label":"Strategic developments","text":"On 30 November 2023, police forces detained the Minister of Finance and Secretary of Treasury at the Judicial Police in Bissau (SAB, Bissau) following the investigation of their connection with the payment of six billion CFA francs to a list of 11 businessmen, through a credit to the Bank of West Africa. They were released by members of the National Guard who invaded the cells. Both are leaders of the African Party for the Independence of Guinea and Cape Verde (PAIGC)."}
{"label":"Strategic developments","text":"Looting: Around 1 December 2023 (as reported), an armed group, collected, and took farmers' grains from the field in different kebeles of Bure woreda coded to the admin center Bure (Bure town, West Gojam, Amhara)."}
{"label":"Strategic developments","text":"Security measures: On 30 November 2023, joint security forces (coded as SSPDF) were deployed on the Wau to Kuajok road due to insecurity (location coded to Wau in Wau North, Western Bahr el Ghazal state) and an curfew on road usage from 6 pm to 6 am was also enforced."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets from Gaza toward southern Israel, causing sirens to sound in Eliav, near Qiryat Gat (Ashqelon, HaDarom), and surrounding areas. Not all of the rockets hit populated areas, as some were likely intercepted over the area of Qiryat Gat or fell in open areas. The PIJ claimed responsibility for firing rockets in the general direction of Eliav."}
{"label":"Strategic developments","text":"Security measures: On 1 December 2023, US forces enacted security measures including increased surveillance in and around the Ain Assad Air Base in Anbar. The security measures are in anticipation of new attacks targeting the base after the end of the Gaza ceasefire."}
{"label":"Strategic developments","text":"Security measures: On 1 December 2023, in Kingston, Kingston, a 48- hour curfew ending on December 3 at 6 p.m. was imposed in a section of the Jones town and Admiral Town in Kingston 12. There is no information on the motives for the curfew."}
{"label":"Strategic developments","text":"Other: On 1 December 2023, Israel and Hamas returned to combat after the two sides failed to reach an agreement on an extension to their seven-day truce. According to Israeli sources, Hamas violated the agreement by firing rockets and failing to provide a list of hostages to be released. Israel responded to these actions by resuming their offensive on Gaza. Over the course of the seven-day truce, 105 civilian hostages were released from Gaza, including 81 Israelis and 24 foreign nationals, in exchange for 210 Palestinian prisoners. Hamas is still holding 137 hostages in Gaza. Coded at Tel Aviv."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Ukrainian military forces intercepted 8 Russian kamikaze-drones over the Mykolaiv region (coded to Mykolaiv, Mykolaiv)."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets toward central Israel, causing sirens to sound in Ramla (HaMerkaz) and surrounding areas. Not all of the rockets hit populated areas, as several were intercepted over the area of Ramla or fell in open areas."}
{"label":"Strategic developments","text":"Looting: On 1 December 2023, Israeli settlers stole olive harvests and damaged farming equipment in a Palestinian-owned agricultural land in Khirbet Yanun (Nablus, West Bank)."}
{"label":"Strategic developments","text":"Interception: On 1 December 2023, Hamas militants fired barrages of rockets from Gaza toward southern Israel, causing sirens to sound in Ashdod (Ashqelon, HaDarom) and surrounding areas. No direct hits to populated areas were reported, as at least six rockets were intercepted over the area of Ashdod, while others likely fell in open areas."}
{"label":"Strategic developments","text":"On 30 November 2023, police officers arrested a PF central committee member in Lusaka (Lusaka, Lusaka) following charges related to hate speech towards people of southern province. He was sentenced to five months imprisonment with hard labor in Kasama."}
{"label":"Violence against civilians","text":"On 1 December 2023, in Altamirano, Chiapas, a group of armed individuals from the self-defense group Autodefensa 14 de Agosto shot indiscriminately around the main streets of the city. One state police officer who was in a convenience store (likely off-duty) was shot and injured. Another two people were also injured. One passer-by was killed. The event is related to the dispute between two political groups in the city. The entrances were also blocked. One group are supporters of the former mayor who was in power for 20 years against followers of the new municipal council, according to police sources. The event is also related a political-social conflict that arose approximately four months ago, when residents of Casitas and Guadalupe neighborhoods protested against the local government due to the lack of works. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Manaus - North Zone (Amazonas), armed individuals shot and killed two men in the Viver Melhor housing complex, Monte das Oliveiras neighborhood. Police believe the attack was motivated by drug trafficking disputes. 2 fatalities."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Salvador - Valeria (Bahia), unidentified armed individuals shot and killed a man, who was an off-duty municipal guard, in a drive-by shooting in the Valeria neighborhood. The suspects were in a silver vehicle and chased the victim's car on the BR-324 highway. The suspects fired seven times against the victim, who lost control of the car. The suspects escaped. Circumstances of the attack are unknown. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Comalcalco, Tabasco, two people were shot and injured by armed men who escaped on two motorcycles in the city center."}
{"label":"Violence against civilians","text":"On 30 November 2023, Israeli forces shot a Palestinian in the Juret al Araj area near the separating wall in Idhna (Hebron, West Bank). The Palestinian was injured in the thigh and hospitalized."}
{"label":"Violence against civilians","text":"Around 30 November 2023 (as reported), in Ensenada, Baja California, a man was killed and the body was found with the hands tied up and covered with a blanket. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Tijuana, Baja California, a officer of the National Institute of Migration was beaten up and injured by four people with bamboo sticks in Colonia Terrazas del Valle."}
{"label":"Violence against civilians","text":"On 1 December 2023, in Duarte, Guanajuato, a man was shot and injured by two armed men in colonia La Lomita."}
{"label":"Violence against civilians","text":"On 30 November 2023, the Sokoto militia raided Gidan Marayu near Dundaye (Wamakko, Sokoto). They abducted an unspecified number of the residents."}
{"label":"Violence against civilians","text":"Around 30 November 2023, (from 26 to 29 November 2023), ADF killed 8 civilians in Bangole groupement and its surroundings, Babila Babombi (Mambasa, Ituri), coded to Mambasa. The chiefdoms of Babila Bakwanza and Babila Babombi, located southwest of Bunia, Mambasa are currently targets of ADF."}
{"label":"Violence against civilians","text":"On 30 November 2023, unknown assailants (described as bandits, coded as Unidentified Ethnic Militia) attacked and killed a four-year-old boy in Chepter village (coded to the county headquarters as Kapenguria, West Pokot, West Pokot County). The motive of the killing remains unclear."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Contagem (Minas Gerais), an armed individual who arrived with an accomplice shot and killed a man in the Sao Mateus neighborhood. Police believe the victim was killed in the context of territorial disputes between rival drug trafficking groups. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, OLF Shane attacked farmers working on their grain field in Jeju woreda (location coded to Arboye, Arsi, Oromia), killing 2 farmers and kidnapping 1 other farmer. The reason for the attack is unknown, and the whereabout of the kidnapped person is still not known."}
{"label":"Violence against civilians","text":"On 30 November 2023, Israeli military forces shot and injured a Palestinian journalist south of Wadi Gaza (coded to Gaza - Nezarim) (Gaza City, Gaza Strip)."}
{"label":"Violence against civilians","text":"Around 30 November 2023 (as reported), in San Luis Potosi, San Luis Potosi, a man was killed and his body was found with his hands tied up and a message in Colonia La Virgen. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, JNIM militants killed two civilians and seized about 100 oxen in Diagou, a hamlet of the village of Gnindouga (Fada Ngourma, Gourma)."}
{"label":"Violence against civilians","text":"On 30 November 2023, two Palestinian assailants affiliated with Hamas shot and killed three Israeli civlians in Jerusalem (Judean Mountains). At least six other Israeli civilians were injured in the attack. Two soldiers and an armed civilian fired back at the assailants and killed them. An armed civilian who shot at the assailants was mistaken by soldiers for an attacker. Soldiers then shot the armed civilian and he later died of his wounds."}
{"label":"Violence against civilians","text":"On 1 December 2023, QSD members detained a man while trying to cross to JWS controlled areas in northern Ar Raqqa countryside coded to Ein Issa district."}
{"label":"Violence against civilians","text":"Around 1 December 2023 (as reported), in Cuernavaca, Morelos, a person was killed and the body was found wrapped in two plastic bags with a message in Paso Express. Also in Cuernavaca, a man was killed and his body was found with his hands tied up and gunshot wound around colonia Antonio Barona. 2 fatalities."}
{"label":"Violence against civilians","text":"Around 1 December 2023 (as reported), in Zapopan, Jalisco, a person was attacked and only the hand was found taped around a business in Colonia Mision del Bosque. It is unknown where the rest of the body or person is."}
{"label":"Violence against civilians","text":"On 30 November 2023, Israeli military forces opened fire at agricultural lands east of Khan Yunis (Khan Yunis, Gaza Strip), likely targeting Palestinian farmers. Casualties unknown."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Timon (Maranhao), a group of armed individuals shot three people in the Bela Vista neighborhood. The suspects broke into a residence and shot the victims. The residence belongs to a woman who is married to the leader of the B40 gang. Two people died, including the woman's son, the stepson of the drug trafficker, and the second fatal victim was a man whose identity is unclear. The woman was injured. The suspects escaped. Motivations for the attack are unknown. 2 fatalities."}
{"label":"Violence against civilians","text":"On 1 December 2023, Wagner mercenaries abducted civilians during an air-landing operation by helicopter at the market in the village of Kikara (Douentza, Mopti). Several people were arrested. Those arrested were subsequently released."}
{"label":"Violence against civilians","text":"On 1 December 2023, Israeli military forces opened fire at Palestinian residential areas in Gaza City (Gaza City, Gaza Strip). Meanwhile, warplanes and tanks struck several locations, leaving an unspecified number of fatalities and injuries. Fatalities coded as 10."}
{"label":"Violence against civilians","text":"On 30 November 2023, Israeli forces opened fire and launched tear gas canisters at Palestinians and their homes during a raid on Arrabah (Jenin, West Bank) to conduct arrests. A Palestinian was injured by a bullet in the thigh. 2 Palestinians were arrested."}
{"label":"Violence against civilians","text":"On 30 November 2023, FAMa and Wagner forces abducted ten civilians on the road between Tonka and Goundam (Goundam, Tombouctou)."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Manaus - East Zone (Amazonas), two armed individuals invaded the private residence of a woman in the Jorge Teixeira neighborhood, shot and killed her. Authorship and motivation of the attack are unknown. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, suspected STC Shabwani Defense forces shot and killed 2 brothers in Habban (Shabwah) over a suspected tribal revenge case."}
{"label":"Violence against civilians","text":"On 1 December 2023, a reelected barangay chairperson was killed by unidentified assailants in Barangay Cawit, Zamboanga City (Zamboanga del Sur, Zamboanga Peninsula). Authorities said that the victim received death threats before and during the October 2023 barangay elections and that the victim was a part of anti-drug efforts."}
{"label":"Violence against civilians","text":"On 30 November 2023, Israeli forces opened fire at a Palestinian vehicle near Al Mansura village near Jenin (Jenin, West Bank) as it was passing by. There were no casualties.."}
{"label":"Violence against civilians","text":"On 30 November 2023, in Caracas - Libertador (Distrito Capital), several suspected members of the Jackson la Sombra Gang shot and killed a man, in an attack in the Las Marias sector, Coche parish. The suspects intercepted the victim as he was walking down the La Escuelita street, in the company of another woman carrying a baby, they drew him aside and shot him multiple times at close range. It is thought that the killing is a settling of scores, the suspects managed to escape. The woman and the baby came out unscathed. 1 fatality."}
{"label":"Violence against civilians","text":"On 1 December 2023, Israeli forces physically attacked Palestinian Muslim worshippers in the vicinity of Al Aqsa complex in Al Quds - Old City (Al Quds, West Bank). Israeli forces also fired rubber-coated bullets, skunk water, and tear gas canisters at the worshippers. There were no casualties."}
{"label":"Violence against civilians","text":"On 1 December 2023, in Salinas del Marques, Oaxaca, the director of Salina Cruz Crime Prevention was shot and killed by unidentified armed individuals in Clonia Santa Anita. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, unknown gunmen shot and killed a man in Hejneh town in Deir ez Zor countryside. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, an unidentified armed group abducted a Catholic priest and his driver in Umuekebi, Osu Owerre (Isiala Mbano, Imo). The militia robbed some shops before moving the hostages away."}
{"label":"Violence against civilians","text":"On 30 November 2023, overnight, Al Shabaab shot and killed two civilians in Tayeeg village near Halgan town (Bulo Burto, Hiraan). The civilians were traveling in between Halgan and Garasiyaani."}
{"label":"Violence against civilians","text":"On 1 December 2023, suspected soldiers abducted the Fulani General Secretary of the Collective against Impunity and Community Stigmatization (CISC) in the town of Ouagadougou (Ouagadougou, Kadiogo)."}
{"label":"Violence against civilians","text":"On 30 November 2023, suspected Fulani herders attacked and killed a lady and six men in Pukah or Pukah Pushit (Mangu, Plateau). They also raided Pinper, coded separately. The attack was aimed at avenging the killing of a Fulani man whose body was found in a well. There were 7 fatalities."}
{"label":"Violence against civilians","text":"Around 30 November 2023 (as reported), in Tijuana, Baja California, two people were killed and their bodies were found in colonia Primer Ayuntamiento. One of the bodies was wrapped in a blanket and the other was inside a plastic bag. 2 fatalities."}
{"label":"Violence against civilians","text":"On 1 December 2023, in Ananindeua (Para), an armed individual on a motorcycle killed a man in a drive-by shooting in the Aguas Lindas neighborhood. Authorship and motivation of the attack are unknown. 1 fatality."}
{"label":"Violence against civilians","text":"On 30 November 2023, in the rural area of Quirinopolis municipality (Minas Gerais), two armed individuals invaded a rural property, shot and killed a farmer and injured a lawyer. Authorship and motivation of the attack are unknown. 1 fatality."}
{"label":"Violence against civilians","text":"On 1 December 2023, Saudi forces (coded under ORH) opened fire with machine guns (presumed to be light machine guns) on Ar Raqw in the border district of Monabbih (Sadah) in Yemen killing 1 civilian. The attack weapon was unspecified."}
{"label":"Violence against civilians","text":"Around 1 December 2023 (as reported), in Teresina (Piaui), unidentified drug traffickers abducted two people in the Vila da Paz neighborhood. The victims were drug users and were captured due to drug trafficking debts. They were released by military police officers during an operation that day. It's unclear how long the victims were held captive. Five suspects were arrested. There were no fatalities."}
{"label":"Violence against civilians","text":"On 1 December 2023, Israeli military forces from the 'Radar outpost' opened fire towards shepherds near Chebaa (Hasbeiya). There were no casualties."}
{"label":"Violence against civilians","text":"On 1 December 2023, Israeli forces beat 2 Palestinian men and seized their car in Dura town (Hebron, West Bank). The 2 men were subsequently hospitalized."}
{"label":"Violence against civilians","text":"On 30 November 2023, FAMa and Wagner forces carried out an operation in Sokolo (Niono, Segou). One civilian was killed and another wounded."}
{"label":"Violence against civilians","text":"On 30 November 2023, an unidentified Palestinian group opened fire at an Israeli settler vehicle near Jabal Sabih in Bayta (Nablus, West Bank). No casualties occurred."}
{"label":"Violence against civilians","text":"On 30 November 2023, in the rural area of Tibu municipality (Norte de Santander), armed individuals shot and killed a farmer social leader in the Playa Rica vereda. There is no further information on the motives of the attack but there is presence of the ELN and FARC dissidents in the area. 1 fatality."}
{"label":"Violence against civilians","text":"On 1 December 2023, in Pedras de Fogo (Paraiba), two unidentified armed individuals shot and killed two men inside a local bar. The suspects fired against the men and escaped. Circumstances of the attack are unknown. 2 fatalities."}
{"label":"Violence against civilians","text":"On 30 November 2023, QSD started a security operation and detained twenty Iraqi IDPs in the third section in Hole Camp in Al Hasakeh countryside for unknown reasons."}
