{"text": "After Biden judge orders a plane carrying illegal immigrants to South Sudan to be grounded, 11 ICE agents are detaining them in a conference room in a converted shipping container in Djibouti, where they are at risk of malaria and rocket attacks, and without proper safety equipment. A court filing revealed the hellish conditions for the ICE agents forced to live in thanks to the Biden judge.", "label": "Strategic developments"}
{"text": "Israel launched multiple airstrikes in Lebanon, targeting facilities allegedly used by Hezbollah for drone production and storage. The facilities were in the southern Dahiyeh suburbs of Beirut and Ain Qana in the Nabatieh District, and the strikes were said to be a response to Hezbollah's continued development of military capabilities after the November 2024 ceasefire.", "label": "Strategic developments"}
{"text": "There has been an increase in gang-related massacres in Colombia, with four such killings occurring in Valle del Cauca department so far this year.  The uptick in mass killings has been attributed to increased gang activity in the region and the return of jailed Colombian drug lords who are rebuilding their criminal networks with the help of local gangs.  This trend represents a shift away from rural massacres tied to armed conflict, towards more urban forms of violence tied to organized crime.  As InSight Crime points", "label": "Violence against civilians"}
{"text": "The BRICS Parliamentary Forum released a joint declaration condemning the Pahalgam terrorist attack in India and promising to combat terrorism collectively. The conference invited Indian Speaker Om Birla who advocated for zero tolerance against terrorism and a strong stance against all forms of terrorism.", "label": "Strategic developments"}
{"text": "The article \"Notes on Tunisia\" provides an overview of the North African country, including its history, economy, and culture. The author, Matt Lakeman, spent nearly three weeks in Tunisia and shares his experiences and observations on the country's cities, climate, and people. He also highlights the country's Roman ruins and contrasts Tunisia's present-day status with its potential for future growth and prosperity.", "label": "Strategic developments"}
{"text": "A Ukrainian drone attack on a Russian oil refinery killed a mother and her toddler and sparked an fire that blazed through the night. This attack is part of a recent series of escalating aerial strikes targeting energy and military facilities, which have increased since Donald Trump's election as US president with the aim of bringing a swift end to the war.", "label": "Strategic developments"}
